/* eslint-disable no-useless-escape */
export const commonRegExp = {

  /**
  * 密码正则：英文字母、数字、+*-/_三种中的两种组成
  */

  password: /^((?=.*?[a-zA-Z])(?=.*?[0-9])|(?=.*?[0-9])(?=.*?[\_\+\/\-\*])|(?=.*?[a-zA-Z])(?=.*?[\_\+\/\-\*]))[a-zA-Z0-9\_\+\/\-\*]{6,20}$/,

  /**
   * 手机号正则，用途例如：验证手机号
   */
  // mobilePhone: /^1[3456789]\d{9}$/,
  mobilePhone: /^1\d{10}$/,

  /**
   * 邮箱正则
   */
  email: /^(\w-*\.*)+@(\w-?)+(\.\w{2,})+$/,

  /*
   *微信号码
   */
  wechat: /^[a-zA-Z]([-_a-zA-Z0-9]{5,20})+$/,
}
